# UnconnectedDevice Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..UnconnectedDevice Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Device has an unconnected [Type Name] connector (index = [Index Number]).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnconnectedDevice { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnconnectedDevice As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnconnectedDevice {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace